
function PrivacyPage() {
    return (
        <>
            <p>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ</p>
            <p>
            Дана Політика конфіденційності визначає правила збору, обробки та використання персональних даних (персональної інформації), що передаються Користувачами при використанні Веб-сайту https://bleez.shop/ (надалі – Веб-сайт). 
            </p>
            <p>Персональні дані збираються Адміністрацією Веб-сайту з метою забезпечення реалізації відносин у сфері охорони здоров’я.</p>
            <p>Здійснюючи перегляд Веб-сайту або його використання іншим чином, Користувач приймає та погоджується із методами роботи, описаними в цій Політиці конфіденційності.</p>
            
            <p>Які персональні дані збираються</p>
            <p>1.1. Під час використання Веб-сайту Користувач може прийняти рішення про надання Адміністрації Веб-сайту певної інформації, заповнюючи онлайн-форми, реєструючись на Веб-сайті, роблячи замовлення, звертаючись до Адміністрації тощо. Видами персональних даних, які Користувач може надати, можуть бути, без обмеження, контактна інформація (адреса, електронна пошта, номер телефону, факсу та ін.), ім’я користувача і особисті вподобання, інтереси і використання різних продуктів і послуг, зміст комунікації з Адміністрацією Веб-сайту. Для доступу на Веб-сайт Користувач не зобов’язаний надавати перелічені вище персональні дані, проте в такому випадку деякі функції можуть бути йому недоступні.</p>
            <p>1.2. Відразу після того, як Користувач зайшов на сайт, Адміністрація Веб-сайту може автоматично отримати деяку інформацію, яка може бути використана для його ідентифікації, наприклад, номер домену, IP адреса комп’ютера, вид використовуваного браузера, операційної системи і платформи, технічна інформація, інформація про географічне місцезнаходження під час відвідування Веб-сайту (тривалість перебування, популярні продукти, час відвідування сторінки, шляхи навігації, а також інформація про час, частоту і спосіб використання послуги та ін.). Адміністрація Веб-сайту може використовувати таку інформацію окремо або в сукупності, для технічного управління Веб-сайтом, аналітичної системи відстеження, досліджень і розробок. </p>

            <p>Обробка персональних даних</p>
            <p>2.1. Адміністрація Веб-сайту захищає персональні дані Користувачів, надаючи доступ до них тільки особам, які повинні мати до них доступ в зв’язку з належною реалізацією взаємовідносин між Адміністрацією та Користувачами, або особам, які з інших причин повинні виконувати дії, описані в даному розділі.</p>
            <p>2.2. Адміністрація Веб-сайту може обробляти інформацію, яка вказана у профілі Користувача на Веб-сайті. Дані профілю можуть містити ім’я, адресу, номер телефону, електронної адреси, фото профілю, стать, дату народження, сімейний статус, інтереси і хобі, дані про освіту і місце роботи. Дані профілю можуть бути оброблені для надання Користувачу можливості використання та моніторингу Веб-сайту, придбання товарів та отримання послуг, створення особистого профілю Користувача і управління ним, роботи з Веб-сайтом, забезпечення безпеки Веб-сайту та послуг, резервного зберігання даних в базах і комунікації з Користувачами. </p>
            <p>2.3. Адміністрація Веб-сайту може обробляти інформацію, яку Користувач публікує на Веб-сайті. Дані публікації можуть бути оброблені з метою вирішення питань, пов’язаних з публікацією або управління Веб-сайтом і послугами. </p>
            <p>2.4. Адміністрація Веб-сайту може обробляти інформацію з запиту Користувача про товари/послуги. Дані запиту можуть бути оброблені з ціллю пропозиції, маркетингу та продажу відповідних товарів/послуг та для обробки окремих запитів Користувачів. </p>
            <p>2.5. Адміністрація Веб-сайту може обробляти надану Користувачем інформацію з метою підписання його на електронні розсилки та / або інформаційні листи. Дані про повідомлення можуть оброблятися з метою відправки Користувачу відповідних повідомлень та / або інформаційних листів, інформації про товари, послуги і рекламних матеріалів. Після того, як Користувач підпишеться на розсилку на Веб-сайті, Адміністрація Веб-сайту направляє йому повідомлення на вказану електронну адресу для підтвердження. Якщо Користувач не підтвердить підписку, вона буде автоматично видалена. Користувач може в будь-який момент відкликати свою згоду на отримання розсилки.</p>
            <p>2.6. Персональні дані обробляються відповідно до чинного законодавства України. Правова підстава такої обробки – забезпечення реалізації відносин у сфері охорони здоров’я, моніторинг та покращення роботи Веб-сайту та якості товарів/послуг.</p>
        
            <p>Передача персональних даних</p>
            <p>3.1. Адміністрація Веб-сайту не розголошує і не передає персональні дані Користувачів третім особам без згоди їхнього носія. </p>
            <p>3.2. Персональні дані Користувачів можуть бути відкриті та передані у випадках, передбачених діючим законодавством України.</p>

            <p>Збереження та видалення персональних даних</p>
            <p>4.1. Персональні дані, які обробляються Адміністрацією Веб-сайту для будь-яких потреб, не повинні зберігатися довше, ніж це необхідно для таких потреб.</p>
            <p>4.2. Персональні дані Користувача зберігаються протягом мінімального періоду – 1 робочий день після прийняття Користувачем даної Політики конфіденційності, а також протягом максимального періоду – 3 робочі дні після повідомлення про скасування підписки або запиту про видалення даних.</p>
            <p>4.3. Незалежно від інших положень цього Розділу, Адміністрація Веб-сайту може зберігати персональні дані Користувача, якщо таке зберігання є необхідним для дотримання юридичного зобов’язання, що регулює роботу Веб-сайту, або для захисту життєвих інтересів Користувача.</p>
            
            <p>Файли Cookie</p>
            <p>5.1. Сookie – це файли, що містять ідентифікатор (набір букв і цифр), відправлений інтернет-сервером інтернет-браузеру і який зберігається в браузері. Ідентифікатор надсилається на сервер щоразу, коли браузер запитує сторінку з сервера.</p>
            <p>5.2. Адміністрація Веб-сайту використовує cookie в наступних цілях: аутентифікація – використання cookie для ідентифікації Користувача під час відвідування ним Веб-сайту та навігації по ньому; статус – використання cookie для визначення, чи ввійшов Користувач на Веб-сайт під своїм логіном; персоналізація – використання cookie для зберігання інформації про запити Користувача і персоналізації Веб-сайту під його потреби; безпека – використання cookie як елементу захисту облікового запису Користувача, в тому числі для запобігання несанкціонованого використання даних входу і захисту Веб-сайту та послуг в цілому; реклама – використання cookie для показу реклами, яка може бути цікава Користувачу; аналіз – використання cookie для аналізу ефективності роботи Веб-сайту та товарів/послуг.</p>
            
            <p>Зміни та доповнення</p>
            <p>6.1. Адміністрація Веб-сайту може змінювати та доповнювати дану Політику конфіденційності, публікуючи її нову версію на Веб-сайті.</p>
            <p>6.2. Такі зміни та доповнення вступають в силу з моменту опублікування нової версії Політики конфіденційності на Веб-сайті. </p>
            <p>6.3. Продовжуючи використовувати Веб-сайт, Користувач підтверджує свою згоду з умовами Політики конфіденційності з відповідними змінами та доповненнями.</p>
        </>
    )
}

export {
    PrivacyPage
}