import {useState} from 'react'
import './style.scss'

function FAQ() {
    const [arr] = useState([
        {   faqId: 1,
            faqTitle: 'Доставка та оплата',
            faqContentArr: [
                {id: 1, title: 'Як відбувається доставка замовлення?', text: 'По Україні доставка замовлень здійснюється з міста Львів перевізником Нова Пошта. Вартість доставки по Україні фіксована — 50 грн. Для львів’ян також доступна доставка велокур’єром — 60 грн. При замовленні від 800 грн доставка безкоштовна. Безкоштовна доставка не працює під час великих розпродажів у Black Friday.'},
                {id: 2, title: 'Як швидко я отримаю замовлення?', text: 'Усі замовлення опрацьовуються впродовж 1-3 робочих днів з дня зарахування оплати. Відправлення здійснюється у робочі дні з понеділка по п’ятницю. Детальніше розрахувати терміни доставки та відстежити рух вашого замовлення за номером накладної, можна на офіційному сайті Нової Пошти.'},
                {id: 3, title: 'Як оплатити?', text: 'Оплата замовлення відбувається онлайн за допомогою платіжних систем Way4Pay та LiqPay. Доступна оплата карткою та готівкою в автоматах самообслуговування. Слідуйте інструкціям та підказкам платіжної системи для здійснення оплати. Якщо у вас виникли труднощі з оплатою — перевірте налаштування інтернет лімітів вашої картки, проконсультуйтесь з підтримкою вашого банку. Інструкція з оплати в системі WayForPay знаходиться тут.'},
            ],
        },
        {   faqId: 2,
            faqTitle: 'Покупки',
            faqContentArr: [
                {id: 1, title: 'Я здійснив замовлення. Що далі?', text: 'Після отримання замовлення ми не будемо турбувати вас телефонними дзвінками. Сповіщення про статус замовлення та номер відстеження Нової Пошти ви отримаєте через смс, емейл або у Telegram, вибравши відповідні опції при створенні замовлення. Щоб скористатись сповіщеннями у Telegram вам необхідно зареєструватись на сайті та активувати відповідну опцію в персональному кабінеті. У випадку доставки велокур’єром вам зателефонують для узгодження часу доставки.'},
                {id: 2, title: 'Чи є в наявності вибраний товар?', text: 'Все, що доступно для замовлення у нашому онлайн магазині і не позначено як “розпродано”, є в наявності і готове до відправки.'},
                {id: 3, title: 'Виникли проблеми із замовленням/хочу змінити або скасувати замовлення', text: 'Напишіть нам на електронну скриньку hello@bleez.shop'},
                {id: 4, title: 'Я хочу обміняти/повернути придбаний товар', text: 'Шкарпетки підлягають обміну/поверненню лише у випадку браку або у випадку суттєвого пошкодження внаслідок транспортування. Якщо через нашу помилку ви отримали іншу модель чи розмір шкарпеток, обмін відбувається за наш рахунок (за умови, що шкарпетки не використовувались). Напишіть нам на електронну скриньку hello@bleez.shop. Білизна належної якості не підлягає обміну/поверненню (згідно статті 9 Закону України «Про захист прав споживачів»).'},
                {id: 5, title: 'Де можна придбати окрім онлайн-магазину?', text: 
                    <>
                        <p className="faq__text">Придбати шкарпетки можна у наших фірмових магазинах:</p>
                        <p className="faq__text">Крамничка Bleez у Тернополі на Федорова:</p>
                        <p className="faq__text">вул. Федорова, 2, з 12:00 до 21:00,</p>
                        <p className="faq__text">тел.: +38 063 419 8456</p>
                    </>
                },
                {id: 6, title: 'Як переконатись що у магазинах мого міста є те що мене цікавить?', text: 'Для цього слід зателефонувати в потрібний магазин.'},
            ],
        },
        {   faqId: 3,
            faqTitle: 'Загальні питання',
            faqContentArr: [
                {id: 1, title: 'Що таке купон і як отримати знижку?', text: 
                    <>
                        <p className="faq__text">Існує три способи отримати купони на знижку:</p>
                        <ul>
                            <li className="faq__text">1) Підписатись на нашу емейл розсилку, ви отримаєте купон -10% на першу покупку.</li>
                            <li className="faq__text">2) Стежити за нашими соцмережами (Facebook, Instagram) та емейл розсилкою щоб не пропустити знижки та спеціальні пропозиції</li>
                            <li className="faq__text">3) Зареєструватись у нас на сайті. За кожну покупку вам буде нарахований бонус, який ви можете використати самі впродовж 10 днів або поділитись ним з друзями.</li>
                        </ul>
                        <p className="faq__text">Щоб застосувати код купону, достатньо ввести його під час оформлення замовлення, натиснути кнопку «Застосувати» і отримати миттєву знижку.</p>
                    </>
                },
                {id: 2, title: 'Для чого реєструватись на сайті?', text: 
                    <>
                        <p className="faq__text">Зареєстровані користувачі отримують доступ до особистого кабінету. Кабінет дозволяє:</p>
                        <ul className="faq__list-style-disc">
                            <li className="faq__text">Бачити історію замовлень та відстежувати статус замовлень</li>
                            <li className="faq__text">Зберегти свої вибрані адреси доставки для швидкого вибору при замовленні</li>
                            <li className="faq__text">Додавати товари у WishList – список бажань</li>
                            <li className="faq__text">Обрати способи інформування про статус замовлення: смс, емейл, Telegram</li>
                            <li className="faq__text">Отримувати купони на знижку для себе та друзів за покупки</li>
                        </ul>
                    </>
                },
                {id: 3, title: 'У мене є класна ідея або побажання', text: 'Ми завжди раді новим ідеям, людям та спілкуванню. Пишіть нам на електронну скриньку hello@bleez.shop'},
                {id: 4, title: 'Я хочу зробити шкарпетки з своїми принтами', text: 'Без проблем! Напишіть нам на електронну скриньку partner@bleez.shop'},
            ],
        },
        {   faqId: 4,
            faqTitle: 'Органічна бавовна',
            faqContentArr: [
                {id: 1, title: 'Що таке органічна бавовна?', text: 'Органічна бавовна вирощена за новими технологіями, які мають на меті зменшити техногенний (людський) вплив на довкілля.'},
                {id: 2, title: 'Чим вона відрізняється від звичайної?', text: 'При вирощуванні органічної бавовни витрачають на 91% менше прісної води та не використовують небезпечні хімікати та пестициди.'},
                {id: 3, title: 'Яким чином зменшується використання води?', text: 'Органічна бавовна росте в дощових районах Індії, тож полив не потребує використання води з річок та джерел.'},
                {id: 4, title: 'Які ще переваги?', text: 'Менший вплив на зміну клімату, не забруднює воду та ґрунти.'},
                {id: 5, title: 'Компостується? Переробляється?', text: 'Ні. Екологічність шкарпеток полягає в їх створенні, а не експлуатації і утилізації.'},
                {id: 6, title: 'Чому шкарпетки коштують більше?', text: 'Оскільки передбачає задіяння у виробництві більшого обсягу ручної праці, що впливає на ціну сировини.'},
                {id: 7, title: 'Як доглядати?', text: 'Все, як завжди: прати навиворіт при температурі не більше 40 градусів, не сушити, не відбілювати, не прасувати і любити.'},
            ],
        },
        {   faqId: 5,
            faqTitle: 'Потрібна допомога?',
            faqContentArr: [
                {id: 1, title: '', text: 
                    <>
                        <p className="faq__text">Якщо у вас все ще залишились запитання, ви можете звернутись до нас.</p>
                        <p className="faq__text">Email: hello@bleez.shop</p>
                    </>
                },
            ]
        }
    ])

    return (
        <>
            <h1 className="visually-hidden">Сторінка FAQ</h1>
            {arr.map(obj => {
                return (
                    <section key={obj.faqId} className="faq__section">
                        <h2 className="faq__h2 box-shadow">{obj.faqTitle}</h2>
                        <ul className="faq__list">
                            {obj.faqContentArr && obj.faqContentArr.map(el => {
                                return (
                                    <li key={el.id} className="faq__item">
                                        <h3 className="faq__title">
                                            {el.title}
                                        </h3>
                                        {typeof(el.text) === 'string' 
                                        ?
                                        <p className="faq__text">{el.text}</p>
                                        :
                                        el.text
                                        }
                                    </li>
                                )
                            })}
                        </ul>            
                    </section> 
                )
            })}
        </>
    )
}

export {
    FAQ
}